Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/care_in_your_community/public_health_nurses.html.txt.tmx
Source language: en
Languages: ga

source: Public health nurses are employed by the Health Service Executive (HSE) to provide a range of health care services in the community
ga: Fostaíonn Feidhmeannacht na Seirbhíse Sláinte altraí sláinte poiblí le réimse seirbhísí a chur ar fáil

source: They are usually based in your local health centre and are assigned to cover specific geographical areas
ga: Bíonn siad lonnaithe go hiondúil in ionaid sláinte go háitiúil agus bíonn ceantar faoi leith faoina gcúram

source: They provide services in schools, in health centres, in day care and other community centres and in people's homes
ga: Cuireann siad seirbhísí ar fáil i dtithe daoine, in ionaid sláinte, in ionaid chúraim lae, in ionaid phobail agus i scoileanna

source: Public health nursing teams provide basic nursing care as well as advice and assistance to their patients
ga: Cuireann foirne altraí sláinte poiblí bunchúram altranais ar fáil chomh maith le comhairle agus cúnamh dá n-othair

source: Public health nurses also act as an important point of access for other community care services
ga: Is féidir teacht ar sheirbhísí eile cúraim phobail tríd na haltraí sláinte poiblí

source: Public health nurses and community registered general nurses liaise with family doctors (GPs), practice nurses, hospitals, hospices and other health service providers to ensure that the needs of the patient are met by the overall health service
ga: Bíonn na haltraí sláinte poiblí agus na haltraí cláraithe pobail ag obair in éineacht le Liachleachtóirí Ginearálta, le haltraí i gcleachtais, leis na hospidéil, na hospísí agus le soláthraithe eile seirbhísí sláinte le cinntiú go bhfuil na riachtanais ar fad atá ag othar dhá shásamh ag an tseirbhís sláinte ina iomlán

source: In some areas, public health nurses keep a register of older people and visit them as a matter of course
ga: Tugann altraí sláinte poiblí cuairt go hiondúil ar leanaí nua saolta agus ar a máithreacha ina mbailte féin

source: The main groups of people to whom public health nurses and their teams provide services are:
ga: Seo a leanas na príomhghrúpaí a gcuireann altraí sláinte poiblí seirbhísí ar fáil dóibh:

source: • Older people who live at home
ga: • Daoine níos sine a bhfuil cónaí ag baile orthu

source: • People who are chronically or acutely ill at home and people who are dying at home
ga: • Daoine a bhfuil tinneas in ainseal orthu nó atá go dona tinn ag baile agus daoine atá ag fáil báis ag baile

source: • Children – infant welfare services, child health services and school health services
ga: • Leanaí – seirbhísí leasa naíonán, seirbhísí sláinte leanaí agus seirbhísí sláinte scoile

source: • Expectant mothers and mothers who have recently given birth
ga: • Máithreacha atá ag súil le leanaí agus a raibh leanaí le deireanas acu

source: • People suffering social deprivation
ga: • Daoine atá ag fulaingt easpa sóisialta

source: • Those who have contracted Hepatitis C directly or indirectly from the use of Human Immunoglobulin-Anti-D or from the receipt within Ireland of any blood product or a blood transfusion and who hold a Health Amendment Act Card
ga: • Daoine a bhfuil Heipitíteas C faighte acu go díreach nó go hindíreach ó Ghlóbailin Imdhíonachta Daonna-Frith-D nó ó aon táirge fola nó aistriú fola a fuair siad in Éirinn agus a bhfuil Cárta faoin Acht um Leasú Sláinte acu

source: Care assistants provide personal care rather than domestic services but there is some overlap between what they do and what home helps do
ga: D'fhéadfadh na hOifigí Sláinte Áitiúla a fhostú le cúnamh a thabhairt don tseirbhís altranais sláinte poiblí cúram pearsanta a thabhairt

source: Access to public health palliative care nursing is via your GP or medical consultant
ga: Cuireann cuid de na heagraíochtaí deonacha, mar shampla Cumann Ailse na hÉireann, seirbhísí altranais ar fáil in éineacht nó in áit na seirbhíse altranais sláinte poiblí

source: Some voluntary organisations, notably the Irish Cancer Society, provide nursing services to complement or as an alternative to the public health nursing service
ga: I roinnt áiteanna cuireann foirne altranais na hospíse altranas maolaitheach ar fáil

source: Palliative nursing is provided in some areas by hospice nursing teams
ga: Is féidir teacht ar altranas cúraim mhaolaithigh tríd do Liachleachtóir Ginearálta nó comhairleoir leighis

source: You can read more about palliative care here
ga: Tá tuilleadh eolais maidir le cúraim mhaolaithigh ar fáil anseo

source: You may be referred to your local public health nurse by your GP, or you may contact the service yourself through your local health centre or through your Local Health Office
ga: D'fhéadfadh sé go mbeadh d'ainm curtha ar aghaidh chuig an altra sláinte poiblí ag do LG nó is féidir leat féin teagmháil a dhéanamh leis an tseirbhís ag an ionad sláinte áitiúil nó tríd d'Oifig Sláinte Áitiúil
